## Plan Result (883: prod_ai - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 5 to destroy.</code></pre>

* Update
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_storage_account.workspace_storage_account
* Replace
  * module.ai.azurerm_machine_learning_compute_instance.compute_instance[0]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-prod"
        name                           = "dlrm-ingest-ai-foundry-prod"
      ~ tags                           = {
          - "__SYSTEM__AIServices_Enda-m9gxngd8-uksouth"                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AIServices_dlrm-aria-document-migration-res"       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__AzureOpenAI_Enda-m9gxngd8-uksouth_aoai"            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AzureOpenAI_dlrm-aria-document-migration-res_aoai" = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
            "application"                                                 = "dlrm-data-ingest"
            "builtFrom"                                                   = "hmcts/dlrm-data-ingest-infra"
            "businessArea"                                                = "cross-cutting"
            "criticality"                                                 = "High"
            "environment"                                                 = "production"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-standard-prod"
        name                               = "dlrm-ingest-cognitive-standard-prod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [] -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_compute_instance.compute_instance[0] must be replaced
-/+ resource "azurerm_machine_learning_compute_instance" "compute_instance" {
      ~ id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod/computes/dlrm-ingest-ci-prod1" -> (known after apply)
        name                          = "dlrm-ingest-ci-prod1"
      - subnet_resource_id            = "/subscriptions/33ad45af-0b2c-404d-b7a3-40778055f1aa/resourceGroups/commonHoboRG42/providers/Microsoft.Network/VirtualNetworks/43bd6bd1-f184-4f7a-b8a3-df8982f2f789-main/subnets/dlrm-ingest-ci-prod1" -> null # forces replacement
        tags                          = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "e51e785d-a811-41a7-9369-7a044d6e5598" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_blob_contributor_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/0bdfad02-fa77-6bca-6609-f92396c0e7c4" -> (known after apply)
      ~ name                                   = "0bdfad02-fa77-6bca-6609-f92396c0e7c4" -> (known after apply)
      ~ principal_id                           = "e51e785d-a811-41a7-9369-7a044d6e5598" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_blob_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/6955e054-f138-5464-ba5c-c087d193cdcd" -> (known after apply)
      ~ name                                   = "6955e054-f138-5464-ba5c-c087d193cdcd" -> (known after apply)
      ~ principal_id                           = "e51e785d-a811-41a7-9369-7a044d6e5598" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_contributor_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/8a5b30fe-e598-7b21-307c-6667c1581eb9" -> (known after apply)
      ~ name                                   = "8a5b30fe-e598-7b21-307c-6667c1581eb9" -> (known after apply)
      ~ principal_id                           = "e51e785d-a811-41a7-9369-7a044d6e5598" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/4cade35f-d8ab-25a1-d3cc-98486ab00828" -> (known after apply)
      ~ name                                   = "4cade35f-d8ab-25a1-d3cc-98486ab00828" -> (known after apply)
      ~ principal_id                           = "e51e785d-a811-41a7-9369-7a044d6e5598" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
        name                               = "dlrmingestaisaprod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":101,"Program":"tfcmt","SHA1":"","Target":"883: prod_ai - TerraformPlanApply","Vars":{}} -->